Revit 2024 API
BuiltInFailures.ProfileFailures Class
 Failures about Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ProfileFailures
Visual Basic
Public NotInheritable Class ProfileFailures
Visual C++
public ref class ProfileFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ProfileFailures
See Also
BuiltInFailures.ProfileFailures Members
Autodesk.Revit.DB Namespace